In [19]:
import pandas as pd
import csv

game_1 = "../resources/pymoli.csv"
game_data = pd.read_csv(game_1)
game_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [20]:
tot_players = game_data['SN'].unique()

summary_df = pd.DataFrame({"Total Players": [len(tot_players)]})

summary_df

   Total Players
0            576

In [21]:
unique_item = game_data["Item ID"].unique()
unique_item

avg_price = game_data["Price"].mean()
round(avg_price, 2)

num_purchases = game_data["Purchase ID"].count()
num_purchases

tot_rev = game_data["Price"].sum()
tot_rev

summary2_df = pd.DataFrame({"Number Of Unique Items": [len(unique_item)], "Average Price": [round(avg_price, 2)], "Number Of Purchases": [num_purchases], "Total Revenue": [tot_rev]})
summary2_df

   Number Of Unique Items  Average Price  Number Of Purchases  Total Revenue
0                     183           3.05                  780        2379.77

In [22]:
gen_ref = game_data["Gender"].value_counts()
gen_sum = game_data["Gender"].count()
pct = gen_ref.div(gen_sum).apply('{:.0%}'.format)

playerdem_df = pd.DataFrame({"Total Count": [gen_ref["Male"], gen_ref["Female"], gen_ref["Other / Non-Disclosed"]], "Percentage Of Players": [pct["Male"], pct["Female"], pct["Other / Non-Disclosed"]]}, index=['Male', 'Female', 'Other / NA'])
playerdem_df

            Total Count Percentage Of Players
Male                652                   84%
Female              113                   14%
Other / NA           15                    2%

In [23]:
df_group = game_data.groupby(['Gender'])
df2_group = game_data.groupby(['SN', 'Gender'])

tpv = df_group["Price"].sum()
app = df_group["Price"].mean()
pc = df_group["Purchase ID"].count()
new = df2_group["Price"].sum()
newnew = new.groupby(['Gender'])
newnewnew = newnew.mean()

summ_df3 = pd.DataFrame({"Purchase Count": pc, "Avg Purchase Price": round(app, 2), "Total Purchase Value": tpv, "Avg Total Purchase per Person": round(newnewnew, 2)})
summ_df3

,Purchase Count,Avg Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.20,361.94,4.47
Male,652,3.02,1967.64,4.07
Other / Non-Disclosed,15,3.35,50.19,4.56

In [24]:
bins = [0, 9, 14, 19, 24, 29, 34, 39, 100]
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]
game_data["Age Ranges"] = pd.cut(game_data["Age"], bins, labels=group_names)
game_test1 = game_data.drop_duplicates(['SN'], keep='last')

ggame_data = game_test1.groupby(["Age Ranges"])
c2game_data = (ggame_data["Age"].count() / game_test1["Age"].count()).apply('{:.0%}'.format)
cgame_data = ggame_data["Age"].count()
summ_df4 = pd.DataFrame({"Total Count": cgame_data, "Percentage of Players": c2game_data})
summ_df4

            Total Count Percentage of Players
Age Ranges
<10                  17                    3%
10-14                22                    4%
15-19               107                   19%
20-24               258                   45%
25-29                77                   13%
30-34                52                    9%
35-39                31                    5%
40+                  12                    2%

In [25]:
summ5 = game_data.groupby(["Age Ranges"])
summ6 = summ5["Purchase ID"].count()
summ7 = round(summ5["Price"].mean(), 2)
summ8 = summ5["Price"].sum()
summ9 = game_data.groupby(['SN', 'Age Ranges'])
summ10 = summ9["Price"].sum()
summ11 = summ10.groupby(['Age Ranges'])
summ12 = summ11.mean()

summ_df5 = pd.DataFrame({"Purchase Count": summ6, "Average Purchase Price": summ7, "Total Purchase Value": summ8, "Avg Total Purchase per Person": round(summ12, 2)})
summ_df5

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,3.35,77.13,4.54
10-14,28,2.96,82.78,3.76
15-19,136,3.04,412.89,3.86
20-24,365,3.05,1114.06,4.32
25-29,101,2.90,293.00,3.81
30-34,73,2.93,214.00,4.12
35-39,41,3.60,147.67,4.76
40+,13,2.94,38.24,3.19

In [26]:
tspender1 = game_data.groupby(["SN"])
tspender2 = tspender1["Purchase ID"].count()
tspender3 = tspender1["Price"].mean()
tspender4 = tspender1["Price"].sum()

tspender5 = pd.DataFrame({"Purchase Count": tspender2, "Average Purchase Price": round(tspender3, 2), "Total Purchase Value": tspender4})
sort_tspender5 = tspender5.sort_values("Total Purchase Value", ascending=False)
sort_tspender5.head()

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                    3.79                 18.96
Idastidru52               4                    3.86                 15.45
Chamjask73                3                    4.61                 13.83
Iral74                    4                    3.40                 13.62
Iskadarya95               3                    4.37                 13.10

In [27]:
MPI_df = pd.DataFrame({"Item ID": game_data["Item ID"], "Item Name": game_data["Item Name"], "Item Price": game_data["Price"], })
MPI_dfgroup = MPI_df.groupby(["Item ID", "Item Name"])
MPI_1 = MPI_dfgroup["Item Price"].count()
MPI_2 = MPI_dfgroup["Item Price"].unique()
MPI_3 = MPI_dfgroup["Item Price"].sum()

MPI_summary = pd.DataFrame({"Purchase Count": MPI_1, "Item Price": MPI_2, "Total Purchase Value": MPI_3})
MPI_summary_sort = MPI_summary.sort_values("Purchase Count", ascending=False)
MPI_summary_sort.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,[4.23],50.76
145,Fiery Glass Crusader,9,[4.58],41.22
108,"Extraction, Quickblade Of Trembling Hands",9,[3.53],31.77
82,Nirvana,9,[4.9],44.10
19,"Pursuit, Cudgel of Necromancy",8,[1.02],8.16

In [28]:
MPI_summary_sort2 = MPI_summary.sort_values("Total Purchase Value", ascending=False)
MPI_summary_sort2.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,[4.23],50.76
82,Nirvana,9,[4.9],44.10
145,Fiery Glass Crusader,9,[4.58],41.22
92,Final Critic,8,[4.88],39.04
103,Singed Scalpel,8,[4.35],34.80